       IDENTIFICATION DIVISION.
       PROGRAM-ID. SOMA-WASM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1      PIC 9(5).
       01 NUM2      PIC 9(5).
       01 RESULT    PIC 9(6).

       PROCEDURE DIVISION USING NUM1, NUM2.
           ADD NUM1 TO NUM2 GIVING RESULT
           DISPLAY RESULT
           GOBACK.
